
#render
#сон ночью
label sleep_scene1:
    #Дик, Моника и водитель в машине. День. Моника в платье AfterJail
    #белый экран
    dick "Моника..."
    dick "Моника?"
    dick "Моника!"
    #Моника просыпается в машине
    m "А? ЧТО?"
    "ГДЕ Я???"

    m "ДИК???"
    "Что ты здесь делаешь?"

    dick "Моника, что значит что я здесь делаю?"
    "Я еду с тобой в ресторан."

    m "В какой ресторан?"

    dick "В самый лучший! В отеле La Grand!"
    "Моника, ты себя хорошо чувствуешь?"

    m "Я... Я не знаю..."

    dick "Моника, мне показалось что ты заснула."
    "Ты не выспалась сегодня?"

    m "Я... Заснула?..."
    "Это был сон???"

    dick "Сон? Дорогая, тебе что-то приснилось?"

    m "Мне... Да...."
    "ЭТО БЫЛ СОН!!!"

    fred "Мэм. С вами все в порядке?"

    m "Фрэд?!?!"
    "ТЫ?!?!"

    fred "Да, мэм?"

    m "Ты уволен, Фред!!!"
    "Едь скорее на место и вон из машины!"

    dick "Дорогая???"

    fred "Миссис Бакфетт, но за что вы хотите уволить меня?"
    "В чем причина? Что за проступок я совершил?"

    m "Что за проступок, ты спрашиваешь?!?!"
    "Ты..."
    "Ты... Я не скажу что ты сделал..."
    "Но этого более чем достаточно для увольнения!"

    fred "Мэм, но я не понимаю..."

    m "Значит это все-таки был сон!"
    "Получается Фред этого не делал?"
    "Но нет! Я не смогу находиться рядом с ним после того что я пережила, даже во сне!"

    "Сон!"
    "Ура! Сон!"

    m "Ты уволен, Фред!"

    dick "Дорогая???"

    m "Дик, не надоедай мне!"
    "Ты тоже хорош!"

    "Что ты здесь делаешь? Иди к своей секретарше!"
    "Ходи с ней по ресторанам! Ты не достоин меня!"

    dick "С какой секретаршей, Моника?!"
    "Мне нравишься ТЫ!"

    m "Так, Фред! Быстро останови машину!"
    "Мистеру Дику надо выйти!"

    "А мне надо позвонить!"

    dick "..."

    m "Так, черт, где мой телефон?!"
    "Дик, ты не видел его?"

    dick "У тебя его не было, Моника."
    "Я не знаю почему, но ты не взяла его..."

    m "???"

    dick "Более того, ты почему-то не носишь свои украшения."
    "А где твой браслет? Ты всегда одевала его..."

    m "..."

    dick "И трусики, зачем-то ты их тоже не носишь."
    "Почему, Моника?"

    m "..."

    m "!!!"

    m "Дик... Я..."
    "Погоди, я не понимаю..."

    dick "Моника, дорогая!"
    "Не переживай!"
    "Все будет хорошо!"
    "Главное не забудь!"

    m "Про что я не должна забыть, Дик?"

    dick "Про галстук..."

    m "!!!"

    dick "У тебя все будет хорошо, Моника!"
    "Главное помни про галстук и не разбей мое сердце..."

    m "!!!"

    #Моника просыпается
    mt "АААААХХХ!!!!"

    mt "ГДЕ Я???"

    mt "Что это... что это за дыра?!?!"

    mt "Где Юлия?!"

    mt "..."

    mt "Черт! Я все вспомнила!"

    mt "Этого не может быть!!!"

    "НЕТ!!!"

    #пауза
    #моника сидит думает на кровати, встает

    mt "Стоп. Моника, не унывай!"

    "Давай подумаем что у нас есть на данный момент."

    "У меня нет денег, нет документов."
    "Любой полцейский, который меня остановит, может забрать меня к Маркусу и..."
    "Никаких И! Я не попаду к нему!"

    "На самом деле, не все так плохо."
    "У меня есть крыша над головой, правда я не могу забыть какой ценой она досталась мне..."
    "Этот Фред... Я убъю его!"
    "Но это потом... Моника, давай подумаем про то что делать сейчас..."

    "Итак... Меня пустили в свой же дом при условии что я буду убираться в нем..."
    "ЗА БЕСПЛАТНО!!!"
    "..." #злой взгляд

    "Но хорошо... Если мне надо пройти через это, то я пройду..."
    "Они не знают кто я такая, поэтому моя гордость не сильно пострадает..."
    "Мне надо всего-лишь притвориться... Ненадолго..."
    "Сделать вид что я убираюсь."
    "В конце концов, эта семейка идиотов что здесь живет - она недалекого ума."
    "Притвориться перед ними и обхитрить их будет пустяковой задачей..."

    "Они глазом не успеют моргнуть, как вылетят отсюда, из этого дома."
    "А я займу свое достойное место здесь..."
    "Потому что Я - Моника Бакфетт!"
    "А они - никто!"

    "Эта Бетти..."
    "Черт... Хоть она и дура, но она следит за мной."
    "Куда бы я здесь ни пошла, она следует за мной по пятам..."
    "Так что крыша у меня над головой есть, но еду мне придется доставать где-то еще..."

    "Интересно где?..."

    "Может украсть еду у той дуры на заправке?"
    "Но хочу-ли я воровать?..."

    "Или может спросить еду у того продавца кебабов?"
    "Я видела как он смотрит на меня..."

    #
    "Животное, фу!"
    #
    "Маленькое ничтожество..."

    "Конечно ему никогда не светит прикоснуться к такой красоте как Я..."
    "Но... это можно использовать чтобы достать хоть какую-то пищу..."
    "Я никогда в жизни не пробовала такой еды, но сейчас выбирать не приходится."
    "Даже она мне кажется вкусной сейчас, учитывая что я толком ничего не ела уже давно..."
    "И уж тем более не сравнится с теми помоями, что мне пришлось выпрашивать, когда я была в подвале у Маркуса..."

    "И мне надо как-то придумать как вернуть назад свое положение..."
    "Дик... Да уж, помощник!"
    "Этот подкаблучник теперь влюблен в свою новую секретаршу."
    "Эту сучку!"
    "Это ее происки по поводу галстука!"
    "Мне надо сходить к нему еще раз, может получится отбить Дика у нее?"
    "В конце концов, чтобы вернуть назад свои деньги, мне надо сначала отделаться от Маркуса!"
    "А в этом мне может помочь только Дик!"
    "Еще эти его дурацкие слова про галстук!"
    "Уверена что Дик просто шутил!"
    "Не думаю что мне стоит всеръез воспринимать его слова об этом!"
    "..."

    "Мне интересно что там происходит в моем офисе?"
    "Кто-то сменил код на лифте, но может я найду способ попасть туда?"
    "Я хочу посмотреть на того смельчака, который посмел занять мое место!"
    "Да и как это вообще возможно?!"
    "Я - Моника Бакфетт!"
    "Я - лицо модного журнала!"
    "Невозможно представить журнал без меня!"
    "Это невозможно! И, думаю, они это прекрасно понимают!"
    "Поэтому им не обойтись без меня!"
    "Это шанс для меня вернуть все назад..."


    "Стив?..."
    "Нет, к этому слизняку в таком виде идти точно не стоит."
    "Этот мешок с дерьмом сделает все чтобы использовать это небольшое недоразумение в своих целях..."
    "Я его слишком хорошо знаю..."
    #если была угроза увольнения Джейн и Тиффани
    "Плюс вокруг недо въются эти две проститутки..."
    "Тиффани и Джейн..."
    "После того как я угрожала уволить их, они могут быть пострашнее той секретарши у Дика..."
    "Жалкие ничтожества..."

    "И мне вообще стоит поменьше показываться в таком виде перед людьми, которые мне знакомы."
    "Это касается и моих подружек Стефани и Ребекки..."
    "В конце концов, мне придется общаться со всеми ними когда я верну положение в обществе."
    "И вообще, надо бы найти одежду получше чем те тряпки, которые я схватила у той шлюхи..."
    "Не могу поверить что мне приходится ходить в этом по городу..."
    "Может лучше ходить в униформе Юлии?"
    "Как хорошо что меня никто не узнает в этом!"
    "Никто даже подумать не может что Моника Бакфетт может ходить по улице в униформе горничной..."
    "Или в одежде проститутки..."
    "Это мне на руку!"

    "..."
    "Ральф..."
    "Его было бы очень просто отбить у этой провинциальной дуры."
    "После этого выкинуть того маленького недоноска и эту Бетти из дома."
    "А потом выкинуть и Ральфа..."
    "Но Бетти не дает возможности даже взять бутерброд на кухне, что уж говорить о том что она не даст даже близко приблизиться к Ральфу..."

    "..."

    "Барди..."
    "Этот мелкий неудачник даже не заслуживает внимания."
    "Он вертится вокруг как назойливая муха!"
    "Считает что я ему обязана тем что нахожусь здесь!"
    "Наивный дурачок!"
    "Надо как-то избавиться от него..."

    #играет музыка kill bill
    m "Да, это все небольшое недоразумение..."
    "И, когда я решу его, я поквитаюсь со всеми вами!"
    "Клянусь!"

    #музка гаснет
    mt "..."
    "Итак..."
    "Сейчас, думаю, надо притвориться горничной."
    "Затем пойти поискать еду..."
    "Думаю мне необязательно все время убираться здесь..."
    "Эта семейка не привыкла к тем стандартам чистоты, которые требовала я от гувернанток."
    "Но иногда убираться все-же стоит. Это может вызвать доверие у Бетти."
    "Хотя зачем мне ее доверие?"
    "Мне, почему-то, кажется что еду брать она все-равно не разрешит."
    return

label spot_monica_comment1:
    #Моника комментирует пятно на полу
    mt "Я не собираюсь убирать это пятно!"
    "Этот ковер надо менять!"
    "Думаю Бетти это прекрасно понимает, потому и не говорит про пятно."
    return

label start_cleaning_choice1:
    #После выхода из спальни в подвале с утра выскакивает предложение начать уборку
    #Уборка происходит в двух локациях, случайно выбранных из
    #Floor2, Floor1, bedroom_bardie, bedroom_second, living_room, bedroom1 и bedroom2
    menu:
        "Начать уборку.":
            mt "Сегодня пришла очередь убрать"
            "Верхний холл."
            "Нижний холл."
            "Спальню Барди."
            "Спальню для гостей."
            "Гостиную."
            "Мою бывшую спальню."
            m "Моя бывшая спальня..."
            "Но ничего! Скоро она будет снова моя! Клянусь!"
            pass
        "Не убираться...":
            pass
    return

label cleaning_betty_comment1:
    #render
    #комментарий Бетти hall2
    #если не набралось 3 дней уборки
    betty "Моника, гувернантка."
    "Продолжай убираться."

    #если нет пропущенных дней уборки за 3 дня
    betty "Моника, гувернантка."
    "Как я выгляжу?"
    "Тебе нравится?"
    mt "!!!"
    m "Да, Мэм. Вы выглядите великолепно."
    betty "Да, получше чем ты!"
    "Если ты будешь также стараться и дальше, то я возьму тебя с собой на фитнес."
    "Твою фигуру можно поправить."
    m "Да, Мэм..."
    "Спасибо..."
    betty "Продолжай убираться."

    #если есть пропущенные дни уборки за 3 последних дня
    betty "Моника, гувернантка."
    "Ты плохо работаешь и нерегулярно убираешь, я вижу!"
    m "Мэм, простите..."
    "Я буду стараться лучше..."
    betty "Не знаю зачем Ральф тебя держит, Фи!"
    mt "..."
    "Сучка!"
    return

label cleaning_bardie_comment1:
    #render
    #иногда Барди появляется в комнате, где убирается Моника
    #комнаты floor1 (если нет Ральфа), bedroom_second, bedroom_bardie
    bardie "Моника! Покажи трусики!"
    m "Как ты себе позволяешь общаться со старшими?!"
    bardie "Ты гувернантка! Я твой хозяин!"
    "Покажи что у тебя под юбочкой!"
    m "Здесь хозяин Мистер Ральф, а не ты, малявка!"
    "Исчезни, пока я тебя не прибила прямо здесь и сейчас!"
    bardie "Ах ты так!"
    bardie_t "Ну она у меня попляшет!"
    return

label cleaning_bardie_comment2:
    #render
    #когда Моника убирает у Барди в комнате
    bardie "Моника! Убирайся в комнате хозяина как следует!"
    m "Ты здесь не хозяин, малявка!"
    bardie "Если ты мне покажешь трусики, то я разрешу тебе не убирать здесь."
    m "Нет уж! Я ни за что этого не сделаю!"
    "Лучше исчезни!"
    bardie "Ах ты так!"
    bardie_t "Ну она у меня попляшет!"
    return

label cleaning_bardie_comment3:
    #render
    #когда Моника убирает в bedroom_second
    bardie "Моника! Покажи трусики!"
    m "Как ты себе позволяешь общаться со старшими?!"
    bardie "Ты гувернантка! Я твой хозяин!"
    "Покажи что у тебя под юбочкой!"
    m "Здесь хозяин Мистер Ральф, а не ты, малявка!"
    "Исчезни, пока я тебя не прибила прямо здесь и сейчас!"
    bardie "Ах ты так!"
    bardie_t "Ну она у меня попляшет!"
    return

label cleaning_monica_goout1:
    #Моника пытается выйти из дома когда не закончена уборка
    mt "Мне надо закончить эту гребаную уборку, прежде чем уходить!"
    return

label cleaning_monica_finished1:
    #Моника закончила уборку
    mt "Я закончила уборку. Что там у нас дальше?"
    return

#Барди находится либо во дворе (днем), либо у себя в комнате или у лестницы (вечером)
label bardie_comment4:
    #render
    #Барди у лестницы
    bardie "Эй! Гувернантка!"
    "Покажи что у тебя под юбкой!"
    m "С какой стати я буду это делать?!"
    bardie "Ты там что-то прячешь! Ты что-то украла!"
    m "Я ничего не украла, малявка!"
    "Как ты смеешь обвинять меня?!"
    bardie "Тогда докажи! Подними юбку!"
    m "Я не собираюсь ничего доказывать тебе, малявка!"
    "Прочь с дороги!"
    return

label bardie_comment5:
    #Барди на улице
    mt "Я не собираюсь подходить к этой малявке!"
    return

label monica_goout1_governess_restrict:
    #render
    #Street_House_Gate Моника у ворот в униформе горничной, Бетти ее догоняет
    #Рендер в зависимости от времени дня!
    betty "Эй! Дорогуша!"
    "Куда это ты собралась?!"
    m "Миссис Робертс! Я..."
    "Я собиралась идти по свои делам и..."
    betty "Ты собралась вынести собственность дома за его пределы?"
    m "Что Вы имеете ввиду, Мэм?!"
    betty "Эта униформа! Это моя собственность!"
    "Кто разрешал тебе покидать территорию дома, одетой в униформу?"
    "Ты решила украсть ее?!"
    m "Нет, Мэм! Я всего-лишь собиралась выйти ненадолго, чтобы..."
    betty "Собстенность дома не должна покидать его пределы!"
    "Я не понимаю что у тебя за дела за пределами этого дома."
    "Неужели ты уже закончила все дела?"

    #если есть пропущенные дни уборки за 3 последних дня
    "Я вижу как ты отлыниваешь от работы!"

    "За такие деньги, что тебе платят, я думаю у тебя не должно быть свободного времени!"
    "Но если ты решила все-таки уйти, то, будь добра, переоденься в свою одежду!!!"
    "ЯСНО ТЕБЕ?!"
    m "Да, Миссис Робертс... Я поняла..."
    mt "Черт! Похоже, чтобы выйти, мне надо переодеться!"
    return

label monica_wakeup1:
    #Моника встает с утра
    mt "Еще одно утро в этой дыре! Мне надо что-то придумать, чтобы вернуть все назад как было!"
    return

label monica_gosleep1:
    #если Моника голодная
    mt "Я сегодня ничего не ела! Лечь спать голодной?"
    menu:
        "Лечь спать голодной.":
            pass
        "Не ложиться.":
            pass

    #если Моника не ела 3 дня
    mt "Я не ела уже третий день!"
    "Я не могу лечь спать в таком состоянии!"
    "Я ХОЧУ ЕСТЬ!!!"

    menu:
        "Лечь спать.":
            pass
        "Не ложиться.":
            pass
    return












#
