
#render
#сон ночью
label sleep_scene1:
    #Дик, Моника и водитель в машине. День. Моника в платье AfterJail
    #белый экран
    dick "Моника..."
    dick "Моника?"
    dick "Моника!"
    #Моника просыпается в машине
    img 5905
    m "А? ЧТО?"
    "ГДЕ Я???"

    img 5906
    m "ДИК???"
    "Что ты здесь делаешь?"

    img 5907
    dick "Моника, что значит что я здесь делаю?"
    "Я еду с тобой в ресторан."
    img 5908
    m "В какой ресторан?"

    img 5909
    dick "В самый лучший! В отеле La Grand!"
    img 5910
    dick "Моника, ты себя хорошо чувствуешь?"
    img 5911
    m "Я... Я не знаю..."

    img 5912
    dick "Моника, мне показалось что ты заснула."
    "Ты не выспалась сегодня?"

    img 5913
    m "Я... Заснула?..."
    "Это был сон???"

    img 5914
    dick "Сон? Дорогая, тебе что-то приснилось?"

    img 5915
    m "Мне... Да...."
    img 5916
    "ЭТО БЫЛ СОН!!!"

    img 5917
    fred "Мэм. С вами все в порядке?"

    img 5918
    m "Фрэд?!?!"
    "ТЫ?!?!"

    img 5919
    fred "Да, мэм?"

    img 5920
    m "Ты уволен, Фред!!!"
    "Едь скорее на место и вон из машины!"

    img 5921
    dick "Дорогая???"
    img 5922
    fred "Миссис Бакфетт, но за что вы хотите уволить меня?"
    "В чем причина? Что за проступок я совершил?"

    img 5923
    m "Что за проступок, ты спрашиваешь?!?!"
    img 5924
    "Ты..."
    "Ты... Я не скажу что ты сделал..."
    img 5923
    "Но этого более чем достаточно для увольнения!"

    img 5925
    fred "Мэм, но я не понимаю..."

    img 5926
    m "Значит это все-таки был сон!"
    "Получается Фред этого не делал?"
    img 5927
    "Но нет! Я не смогу находиться рядом с ним после того что я пережила, даже во сне!"

    img 5928
    "Сон!"
    "Ура! Сон!"

    img 5929
    with fadelong
    m "Ты уволен, Фред!"

    dick "Дорогая???"

    img 5930
    m "Дик, не надоедай мне!"
    "Ты тоже хорош!"
    "Что ты здесь делаешь? Иди к своей секретарше!"

    img 5931
    "Ходи с ней по ресторанам! Ты не достоин меня!"

    img 5932
    dick "С какой секретаршей, Моника?!"
    "Мне нравишься ТЫ!"

    img 5933
    m "Так, Фред! Быстро останови машину!"
    img 5934
    "Мистеру Дику надо выйти!"

    img 5935
    "А мне надо позвонить!"

    img 5936
    dick "..."

    img 5937
    m "Так, черт, где мой телефон?!"
    img 5938
    "Дик, ты не видел его?"

    img 5939
    dick "У тебя его не было, Моника."
    "Я не знаю почему, но ты не взяла его..."

    img 5940
    m "???"

    img 5941
    dick "Более того, ты почему-то не носишь свои украшения."
    img 5942
    "А где твой браслет? Ты всегда одевала его..."

    img 5943
    m "..."

    img 5944
    dick "И трусики, зачем-то ты их тоже не носишь."
    "Почему, Моника?"

    img 5945
    m "..."
    img 5946
    w
    img 5947
    w
    img 5948
    m "!!!"

    img 5949
    m "Дик... Я..."
    img 5950
    "Погоди, я не понимаю..."

    img 5951
    dick "Моника, дорогая!"
    "Не переживай!"
    "Все будет хорошо!"
    img 5952
    "Главное не забудь!"

    img 5953
    m "Про что я не должна забыть, Дик?"

    img 5954
    dick "Про галстук..."

    img 5955
    m "!!!"

    img 5956
    dick "У тебя все будет хорошо, Моника!"
    img 5957
    "Главное помни про галстук и не разбей мое сердце..."

    img 5958
    m "!!!"

    #Моника просыпается
    img 5959
    mt "АААААХХХ!!!!"

    mt "ГДЕ Я???"

    img 5960
    mt "Что это... что это за дыра?!?!"
    img 5961
    mt "Где Юлия?!"

    mt "..."

    img 5962
    mt "Черт! Я все вспомнила!"

    mt "Этого не может быть!!!"

    img 5963
    img 5964
    "НЕТ!!!"

    #пауза
    #моника сидит думает на кровати, встает

    img 5965
    img 5966
    mt "Стоп. Моника, не унывай!"

    "Давай подумаем что у нас есть на данный момент."

    img 5967
    img 5968
    "У меня нет денег, нет документов."
    "Любой полцейский, который меня остановит, может забрать меня к Маркусу и..."
    img 5969
    "Никаких И! Я не попаду к нему!"

    img 5970
    "На самом деле, не все так плохо."
    "У меня есть крыша над головой, правда я не могу забыть какой ценой она досталась мне..."
    img 5971
    "Этот Фред... Я убъю его!"
    "Но это потом... Моника, давай подумаем про то что делать сейчас..."

    img 5972
    img 5973
    "Итак... Меня пустили в свой же дом при условии что я буду убираться в нем..."

    img 5974
    img 5975
    "ЗА БЕСПЛАТНО!!!"
    img 5976
    "..." #злой взгляд

    img 5977
    img 5978
    "Но хорошо... Если мне надо пройти через это, то я пройду..."
    "Они не знают кто я такая, поэтому моя гордость не сильно пострадает..."
    "Мне надо всего-лишь притвориться... Ненадолго..."
    "Сделать вид что я убираюсь."
    "В конце концов, эта семейка идиотов что здесь живет - она недалекого ума."
    "Притвориться перед ними и обхитрить их будет пустяковой задачей..."

    img 5979
    "Они глазом не успеют моргнуть, как вылетят отсюда, из этого дома."
    "А я займу свое достойное место здесь..."
    img 5980
    "Потому что Я - Моника Бакфетт!"
    "А они - никто!"

    img 5981
    "Эта Бетти..."
    "Черт... Хоть она и дура, но она следит за мной."
    "Куда бы я здесь ни пошла, она следует за мной по пятам..."
    "Так что крыша у меня над головой есть, но еду мне придется доставать где-то еще..."

    img 5982
    img 5983
    "Интересно где?..."

    "Может украсть еду у той дуры на заправке?"
    "Но хочу-ли я воровать?..."

    img 5984
    img 5985
    "Или может спросить еду у того продавца кебабов?"
    "Я видела как он смотрит на меня..."

    img 5986
    #
    "Животное, фу!"
    #
    "Маленькое ничтожество..."

    "Конечно ему никогда не светит прикоснуться к такой красоте как Я..."

    img 5987
    "Но... это можно использовать чтобы достать хоть какую-то пищу..."
    "Я никогда в жизни не пробовала такой еды, но сейчас выбирать не приходится."

    img 5988
    img 5989
    "Даже она мне кажется вкусной сейчас, учитывая что я толком ничего не ела уже давно..."
    "И уж тем более не сравнится с теми помоями, что мне пришлось выпрашивать, когда я была в подвале у Маркуса..."

    img 5990
    img 5991
    "И мне надо как-то придумать как вернуть назад свое положение..."

    img 5992
    "Дик... Да уж, помощник!"
    "Этот подкаблучник теперь влюблен в свою новую секретаршу."

    img 5993
    img 5994
    "Эту сучку!"
    "Это ее происки по поводу галстука!"
    "Мне надо сходить к нему еще раз, может получится отбить Дика у нее?"

    img 5996
    img 5997
    "В конце концов, чтобы вернуть назад свои деньги, мне надо сначала отделаться от Маркуса!"
    "А в этом мне может помочь только Дик!"
    "Еще эти его дурацкие слова про галстук!"
    img 5995
    "Уверена что Дик просто шутил!"
    "Не думаю что мне стоит всеръез воспринимать его слова об этом!"

    img 5998
    img 5999
    "..."
    "Мне интересно что там происходит в моем офисе?"
    "Кто-то сменил код на лифте, но может я найду способ попасть туда?"

    img 6000
    img 6001
    "Я хочу посмотреть на того смельчака, который посмел занять мое место!"
    "Да и как это вообще возможно?!"

    img 6002
    "Я - Моника Бакфетт!"
    "Я - лицо модного журнала!"
    "Невозможно представить журнал без меня!"
    img 6003
    "Это невозможно! И, думаю, они это прекрасно понимают!"
    "Поэтому им не обойтись без меня!"
    "Это шанс для меня вернуть все назад..."

    img 6004
    "Стив?..."
    "Нет, к этому слизняку в таком виде идти точно не стоит."
    "Этот мешок с дерьмом сделает все чтобы использовать это небольшое недоразумение в своих целях..."
    "Я его слишком хорошо знаю..."
    #если была угроза увольнения Джейн и Тиффани
    "Плюс вокруг недо въются эти две проститутки..."
    "Тиффани и Джейн..."
    "После того как я угрожала уволить их, они могут быть пострашнее той секретарши у Дика..."
    "Жалкие ничтожества..."

    img 6005
    "И мне вообще стоит поменьше показываться в таком виде перед людьми, которые мне знакомы."
    "Это касается и моих подружек Стефани и Ребекки..."
    "В конце концов, мне придется общаться со всеми ними когда я верну положение в обществе."
    "И вообще, надо бы найти одежду получше чем те тряпки, которые я схватила у той шлюхи..."

    img 6006
    img 6007
    "Не могу поверить что мне приходится ходить в этом по городу..."
    "Может лучше ходить в униформе Юлии?"
    "Как хорошо что меня никто не узнает в этом!"
    img 6008
    img 6009
    "Никто даже подумать не может что Моника Бакфетт может ходить по улице в униформе горничной..."
    "Или в одежде проститутки..."
    "Это мне на руку!"

    img 6010
    "..."
    "Ральф..."
    "Его было бы очень просто отбить у этой провинциальной дуры."
    "После этого выкинуть того маленького недоноска и эту Бетти из дома."
    "А потом выкинуть и Ральфа..."

    img 6011
    "Но Бетти не дает возможности даже взять бутерброд на кухне, что уж говорить о том что она не даст даже близко приблизиться к Ральфу..."

    "..."

    img 6012
    "Барди..."
    "Этот мелкий неудачник даже не заслуживает внимания."
    "Он вертится вокруг как назойливая муха!"
    "Считает что я ему обязана тем что нахожусь здесь!"
    "Наивный дурачок!"
    "Надо как-то избавиться от него..."

    #играет музыка kill bill
    img 6013
    m "Да, это все небольшое недоразумение..."
    "И, когда я решу его, я поквитаюсь со всеми вами!"
    "Клянусь!"

    #музка гаснет
    img 6014
    mt "..."
    "Итак..."
    "Сейчас, думаю, надо притвориться горничной."
    "Затем пойти поискать еду..."
    img 6015
    "Думаю мне необязательно все время убираться здесь..."
    "Эта семейка не привыкла к тем стандартам чистоты, которые требовала я от гувернанток."
    img 6016
    "Но иногда убираться все-же стоит. Это может вызвать доверие у Бетти."
    "Хотя зачем мне ее доверие?"
    "Мне, почему-то, кажется что еду брать она все-равно не разрешит."
    return

label spot_monica_comment1:
    #Моника комментирует пятно на полу
    mt "Я не собираюсь убирать это пятно!"
    "Этот ковер надо менять!"
    "Думаю Бетти это прекрасно понимает, потому и не говорит про пятно."
    return

label start_cleaning_choice1:
    #После выхода из спальни в подвале с утра выскакивает предложение начать уборку
    #Уборка происходит в двух локациях, случайно выбранных из
    #Floor2, Floor1, bedroom_bardie, bedroom_second, living_room, bedroom1 и bedroom2
    menu:
        "Начать уборку.":
            mt "Сегодня пришла очередь убрать"
            "Верхний холл."
            "Нижний холл."
            "Спальню Барди."
            "Спальню для гостей."
            "Гостиную."
            "Мою бывшую спальню."
            m "Моя бывшая спальня..."
            "Но ничего! Скоро она будет снова моя! Клянусь!"
            pass
        "Не убираться...":
            pass
    return

label cleaning_betty_comment1:
    #render
    #комментарий Бетти hall2
    #если не набралось 3 дней уборки
    img 6017
    betty "Моника, гувернантка."
    "Продолжай убираться."

    #если нет пропущенных дней уборки за 3 дня
    img 6018
    betty "Моника, гувернантка."
    img 6019
    "Как я выгляжу?"
    img 6020
    "Тебе нравится?"
    img 6021
    mt "!!!"
    img 6022
    m "Да, Мэм. Вы выглядите великолепно."
    img 6023
    betty "Да, получше чем ты!"
    img 6024
    "Если ты будешь также стараться и дальше, то я возьму тебя с собой на фитнес."
    "Твою фигуру можно поправить."
    m "Да, Мэм..."
    "Спасибо..."
    img 6025
    w
    img 6026
    betty "Продолжай убираться."

    #если есть пропущенные дни уборки за 3 последних дня
    img 6027
    betty "Моника, гувернантка."
    "Ты плохо работаешь и нерегулярно убираешь, я вижу!"
    img 6028
    m "Мэм, простите..."
    "Я буду стараться лучше..."
    img 6029
    betty "Не знаю зачем Ральф тебя держит, Фи!"
    img 6021
    mt "..."
    "Сучка!"
    return

label cleaning_bardie_comment1:
    #render
    #иногда Барди появляется в комнате, где убирается Моника
    #комнаты floor1 (если нет Ральфа)
    img 6030
    w
    img 6031
    w
    img 6032
    bardie "Моника! Покажи трусики!"
    img 6033
    m "Как ты себе позволяешь общаться со старшими?!"
    img 6034
    bardie "Ты гувернантка! Я твой хозяин!"
    img 6035
    "Покажи что у тебя под юбочкой!"
    img 6036
    m "Здесь хозяин Мистер Ральф, а не ты, малявка!"
    "Исчезни, пока я тебя не прибила прямо здесь и сейчас!"
    img 6037
    bardie "Ах ты так!"
    bardie_t "Ну она у меня попляшет!"
    return

label cleaning_bardie_comment2:
    #render
    #когда Моника убирает у Барди в комнате
    img 6038
    w
    img 6040
    w
    img 6039
    w
    bardie "Моника! Убирайся в комнате хозяина как следует!"
    img 6041
    m "Ты здесь не хозяин, малявка!"
    img 6042
    bardie "Если ты мне покажешь трусики, то я разрешу тебе не убирать здесь."
    img 6043
    m "Нет уж! Я ни за что этого не сделаю!"
    "Лучше исчезни!"
    img 6044
    bardie "Ах ты так!"
    bardie_t "Ну она у меня попляшет!"
    return

label cleaning_bardie_comment3:
    #render
    #когда Моника убирает в bedroom_second
    img 6045
    w
    img 6047
    w
    img 6046
    w
    img 6048
    w
    img 6049
    w
    img 6050
    bardie "Моника! Покажи трусики!"
    img 6051
    m "Как ты себе позволяешь общаться со старшими?!"
    img 6052
    bardie "Ты гувернантка! Я твой хозяин!"
    img 6053
    "Покажи что у тебя под юбочкой!"
    img 6054
    m "Здесь хозяин Мистер Ральф, а не ты, малявка!"
    "Исчезни, пока я тебя не прибила прямо здесь и сейчас!"
    img 6055
    bardie "Ах ты так!"
    bardie_t "Ну она у меня попляшет!"
    return

label cleaning_monica_goout1:
    #Моника пытается выйти из дома когда не закончена уборка
    mt "Мне надо закончить эту гребаную уборку, прежде чем уходить!"
    return

label cleaning_monica_finished1:
    #Моника закончила уборку
    mt "Я закончила уборку. Что там у нас дальше?"
    return

#Барди находится либо во дворе (днем), либо у себя в комнате или у лестницы (вечером)
label bardie_comment4:
    #render
    #Барди у лестницы
    img 6056
    bardie "Эй! Гувернантка!"
    "Покажи что у тебя под юбкой!"
    img 6057
    m "С какой стати я буду это делать?!"
    img 6058
    bardie "Ты там что-то прячешь! Ты что-то украла!"
    img 6059
    m "Я ничего не украла, малявка!"
    "Как ты смеешь обвинять меня?!"
    img 6060
    bardie "Тогда докажи! Подними юбку!"
    img 6061
    m "Я не собираюсь ничего доказывать тебе, малявка!"
    "Прочь с дороги!"
    return

label bardie_comment5:
    #Барди на улице
    mt "Я не собираюсь подходить к этой малявке!"
    return

label monica_goout1_governess_restrict:
    #render
    #Street_House_Gate Моника у ворот в униформе горничной, Бетти ее догоняет
    #Рендер в зависимости от времени дня!
    if day_time == "day":
        img 6062
        w
        img 6063
        betty "Эй! Дорогуша!"
        "Куда это ты собралась?!"
        img 6064
        m "Миссис Робертс! Я..."
        img 6065
        "Я собиралась идти по свои делам и..."
        betty "Ты собралась вынести собственность дома за его пределы?"
        img 6066
        m "Что Вы имеете ввиду, Мэм?!"
        betty "Эта униформа! Это моя собственность!"
        img 6067
        "Кто разрешал тебе покидать территорию дома, одетой в униформу?"
        "Ты решила украсть ее?!"
        img 6068
        m "Нет, Мэм! Я всего-лишь собиралась выйти ненадолго, чтобы..."
        img 6069
        betty "Собстенность дома не должна покидать его пределы!"
        "Я не понимаю что у тебя за дела за пределами этого дома."
        "Неужели ты уже закончила все дела?"

        #если есть пропущенные дни уборки за 3 последних дня
        img 6070
        "Я вижу как ты отлыниваешь от работы!"

        img 6071
        "За такие деньги, что тебе платят, я думаю у тебя не должно быть свободного времени!"
        "Но если ты решила все-таки уйти, то, будь добра, переоденься в свою одежду!!!"
        "ЯСНО ТЕБЕ?!"
        m "Да, Миссис Робертс... Я поняла..."
        img 6072
        mt "Черт! Похоже, чтобы выйти, мне надо переодеться!"
    else:
    #вечер
        img 6073
        w
        img 6074
        betty "Эй! Дорогуша!"
        img 6075
        "Куда это ты собралась?!"
        img 6076
        m "Миссис Робертс! Я..."
        "Я собиралась идти по свои делам и..."
        betty "Ты собралась вынести собственность дома за его пределы?"
        m "Что Вы имеете ввиду, Мэм?!"
        img 6077
        betty "Эта униформа! Это моя собственность!"
        "Кто разрешал тебе покидать территорию дома, одетой в униформу?"
        "Ты решила украсть ее?!"
        img 6078
        m "Нет, Мэм! Я всего-лишь собиралась выйти ненадолго, чтобы..."
        img 6079
        betty "Собстенность дома не должна покидать его пределы!"
        "Я не понимаю что у тебя за дела за пределами этого дома."
        "Неужели ты уже закончила все дела?"

        #если есть пропущенные дни уборки за 3 последних дня
        img 6080
        "Я вижу как ты отлыниваешь от работы!"

        img 6081
        "За такие деньги, что тебе платят, я думаю у тебя не должно быть свободного времени!"
        "Но если ты решила все-таки уйти, то, будь добра, переоденься в свою одежду!!!"
        "ЯСНО ТЕБЕ?!"
        img 6082
        m "Да, Миссис Робертс... Я поняла..."
        img 6083
        mt "Черт! Похоже, чтобы выйти, мне надо переодеться!"
    return

label monica_wakeup1:
    #Моника встает с утра
    mt "Еще одно утро в этой дыре! Мне надо что-то придумать, чтобы вернуть все назад как было!"
    return

label monica_gosleep1:
    #если Моника голодная
    mt "Я сегодня ничего не ела! Лечь спать голодной?"
    menu:
        "Лечь спать голодной.":
            pass
        "Не ложиться.":
            pass

    #если Моника не ела 3 дня
    mt "Я не ела уже третий день!"
    "Я не могу лечь спать в таком состоянии!"
    "Я ХОЧУ ЕСТЬ!!!"

    menu:
        "Лечь спать.":
            pass
        "Не ложиться.":
            pass
    return












#
